schedule = {

    "1 курс": {

        False: {

            "Понедельник": [
                [1, '9:00-10:35', "РЯКР", "Касьянова В.М.", "829"],
                [2, '10:50-12:25', "Общая химия", "Дунаев С.Ф.", "БХА (хим.фак)"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, '15:00-16:35', "Иностранный язык", "-", "-"],
                [5, '16:45-18:20', "Введение в специальность", "Шелепов В.В.", "610"]
            ],
            "Вторник": [
                [1, '9:00-10:35', "Физическая культура", "-", "-"],
                [2, '10:50-12:25', "РЯКР ", "Кортава Т.В.", "611"],
                [3, '12:40-14:15', "Высшая математика", "Панферов  С.В.", "611"],
                [4, '15:00-16:35', "Физика", "Юлдашев П.В.", "805"]
            ],
            "Среда": [
                [1, '9:00-10:35', "Общая геология", "Мышенкова М.С.", "824а"],
                [2, '10:50-12:25', "Высшая математика", "Самсонов С.П.", "830"],
                [3, '12:40-14:15', "Высшая математика", "Панферов С.В.", "611"],
                [4, "15:00 - 16:35", 'ОРГ', "-", "611"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "Физическая культура", "-", "-"],
                [2, '10:50-12:25', "Физика", "Андреенко А.С.", "611"],
                [3, '12:40 - 14:15', 'Общая геология', 'Гущин А.И.', '611'],
                [4, '15:00-16:35', 'История России', 'Купцова И.В.', "611"],
                [5, '16:45 - 18:20', 'История России', 'Купцова И.В.', "611"]
            ],
            "Пятница": [
                [1, '9:00-10:35', "Физический практикум ", "-", "Физ.фак."],
                [2, '10:50-12:25', "Физический практикум ", "-", "Физ.фак."],
                [3, '12:40-14:15', 'Иностранный язык', '-', '-']
            ],
            "Суббота": [
                [1, '9:00-10:35', "Химический практикум ", "-", "Хим.фак."],
                [2, '10:50-12:25', "Химический практикум ", "-", "Хим.фак."],
            ]
        },

        True: {
            "Понедельник": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "Общая химия", "Дунаев С.Ф.", "БХА (хим.фак)"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, '15:00-16:35', "Иностранный язык", "-", "-"],
                [5, '16:45-18:20', "Введение в специальность", "Шелепов В.В.", "610"]
            ],
            "Вторник": [
                [1, '9:00-10:35', "Физическая культура", "-", "-"],
                [2, '10:50-12:25', "РЯКР ", "Кортава Т.В.", "611"],
                [3, '12:40-14:15', "Высшая математика", "Панферов  С.В.", "611"],
                [4, '15:00-16:35', "Физика", "Юлдашев П.В.", "805"]
            ],
            "Среда": [
                [1, '9:00-10:35', "Общая геология", "Блюмкина М.Е.", "824а"],
                [2, '10:50-12:25', "Высшая математика", "Самсонов С.П.", "830"],
                [3, '12:40-14:15', "Высшая математика", "Панферов С.В.", "611"],
                [4, "15:00 - 16:35", 'ОРГ', "-", "611"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "Физическая культура", "-", "-"],
                [2, '10:50-12:25', "Физика", "Андреенко А.С.", "611"],
                [3, '12:40 - 14:15', 'Общая геология', 'Гущин А.И.', '611'],
                [4, '15:00-16:35', 'Высшая математика', 'Панферов С.В.', "611"]
            ],
            "Пятница": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "Высшая математика", "Самсонов С.П.", "804"],
                [3, '12:40-14:15', 'Иностранный язык', '-', '-']
            ],
            "Суббота": [
                [1, '9:00-10:35', "Химический практикум ", "-", "Хим.фак."],
                [2, '10:50-12:25', "Химический практикум ", "-", "Хим.фак."],
            ]
        }
    },
    "2 курс": {

        False: {

            "Понедельник": [
                [1, '9:00-10:35', "Подземная гидромеханика", "Моторова К.А.", "831"],
                [2, '10:50-12:25', "Подземная гидромеханика", "Моторова К.А.", "831"],
                [3, '12:40-14:15', "Философия", "Зимянина Е.В.", "805"],
                [4, '15:00-16:35', "Палеонтология", "Реймерс А.Н.", "805"]
            ],
            "Вторник": [
                [1, '9:00-10:35', "Информатика/Палеонтология", "Князев А.Н./Реймерс А.Н.", "362/514"],
                [2, '10:50-12:25', "Физическая культура", "", ""],
                [3, '12:40-14:15', "Палеонтология/Информатика", "Реймерс А.Н./Князев А.Н.", "514/362"],
                [4, '15:00-16:35', "Информатика", "Князев А.Н.", "816"]
            ],
            "Среда": [
                [1, '9:00-10:35', "Геофизика", "Степанов/Попов/Шевнин", "611"],
                [2, '10:50-12:25', "Основы промысловой гидрогеохимии и гидрогеодинамики", "Корзун А.В./Киреева Т.А.", "805"],
                [3, '12:40-14:15', "Петрография", "Шур М.Ю.", "826"],
                [4, "15:00 - 16:35", 'Геология нефти и газа (3 часа )', "Глебова Л.В.", "612"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "Физическая культура", "-", "-"],
                [3, '12:40 - 14:15', 'Основы промысловой гидрогеохимии и гидрогеодинамики', 'Корзун А.В./Киреева Т.А.', '824а'],
                [4, '15:00-16:35', 'Структурна геология и геокартирование', 'Хотылев А.О., Шалимов И.В.', "509"]
            ],
            "Пятница": [
                [1, '9:00-10:35', "1/2 группы Информатика", "Князев А.Н.", "362"],
                [2, '10:50-12:25', "1/2 группы Информатика", "Князев А.Н.", "362"],
                [3, '12:40-14:15', 'Философия', 'Зимянина Е.В.', '611'],
                [4, '12:40-14:15', 'Геофизика', 'Степанов/Попов/Шевнин', '611'],
                [5, '12:40-14:15', 'Иностранный язык', '-', '-']
            ]
        },

        True: {
            "Понедельник": [
                [1, '9:00-10:35', "Подземная гидромеханика", "Моторова К.А.", "831"],
                [2, '10:50-12:25', "Подземная гидромеханика", "Моторова К.А.", "831"],
                [3, '12:40-14:15', "Структурная геология и геокартирование", "Хотылев А.О.", "611"],
                [4, '15:00-16:35', "Палеонтология", "Реймерс А.Н.", "805"]
            ],
            "Вторник": [
                [1, '9:00-10:35', "Информатика/Палеонтология", "Князев А.Н./Реймерс А.Н.", "362/514"],
                [2, '10:50-12:25', "Физическая культура", "", ""],
                [3, '12:40-14:15', "Палеонтология/Информатика", "Реймерс А.Н./Князев А.Н.", "514/362"],
                [4, '15:00-16:35', "Информатика", "Князев А.Н.", "816"]
            ],
            "Среда": [
                [1, '9:00-10:35', "Геофизика", "Степанов/Попов/Шевнин", "611"],
                [2, '10:50-12:25', "Основы промысловой гидрогеохимии и гидрогеодинамики", "Корзун А.В./Киреева Т.А.", "805"],
                [3, '12:40-14:15', "Петрография", "Шур М.Ю.", "826"],
                [4, "15:00 - 16:35", 'Геология нефти и газа (3 часа )', "Глебова Л.В.", "612"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "Физическая культура", "-", "-"],
                [3, '12:40 - 14:15', 'Основы промысловой гидрогеохимии и гидрогеодинамики', 'Корзун А.В./Киреева Т.А.', '824а'],
                [4, '15:00-16:35', 'Структурна геология и геокартирование', 'Хотылев А.О., Шалимов И.В.', "509"]
            ],
            "Пятница": [
                [1, '9:00-10:35', "Информатика", "Князев А.Н.", "362"],
                [2, '10:50-12:25', "Информатика", "Князев А.Н.", "362"],
                [3, '12:40-14:15', 'Философия', 'Зимянина Е.В.', '611'],
                [4, '12:40-14:15', 'Геофизика', 'Степанов/Попов/Шевнин', '611'],
                [5, '12:40-14:15', 'Иностранный язык', '-', '-']
            ]
        }
    },
    "3 курс": {

        False: {

            "Понедельник": [
                [1, '9:00-10:35', "Бурение скважин", "Глебова Л.В.", "824а"],
                [2, '10:50-12:25', "Иностранный язык", "-", "-"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, '15:00-16:35', "Физика нефтяного пласта", "Михайлов Н.Н.", "801"],
                [5, '16:45 - 18:20', "Комп.обр.дан.нефтегаз.геол", "Аплеталин А.В.", "816"]
            ],
            "Вторник": [
                ["-", '-', '-', '-', '-']
            ],
            "Среда": [
                [1, '9:00-10:35', "Промысловая геофизика", "Никитин А.А.", "301"],
                [2, '10:50-12:25', "Экономика", "Кононова Н.П.", "611"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", 'Межфакультетские курсы', "-", "-"],
                [5, "16:45-18:20", 'Межфакультетские курсы', "-", "-"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "Техника и технология добычи нефти и газа", "Коршунов А.Ю.", "832"],
                [2, '10:50-12:25', "Разработка нефтяных и газонефтяны месторождений", "Казаков А.А.", "805"],
                [3, '12:40 - 14:15', "Разработка нефтяных и газонефтяны месторождений", "Казаков А.А.", "805"],
                [4, '15:00-16:35', 'Промысловая геофизика', 'Никитин А.А.', "301"],
                [5, '16:45 - 18:20', 'Промысловая геофизика', 'Никитин А.А.', "301"]
            ],
            "Пятница": [
                [1, '9:00—10:35', "-", "-", "-"],
                [2, '10:50-12:25', "Разработка нефтяных и газонефтяны месторождений", "Казаков А.А.", "805"],
                [3, '12:40-14:15', 'Компьютер.обр.дан.нетегаз.геол', 'Аплеталин А.В.', '308'],
                [4, '12:40-14:15', 'Теоретические основы и методы поисков и разведки нефтяных и газовых месторождений', 'Шпуров И.В.', '610'],
                [5, '12:40-14:15', 'Теоретические основы и методы поисков и разведки нефтяных и газовых месторождений', 'Шпуров И.В.', '610']
            ]
        },

        True: {
            "Понедельник": [
                [1, '9:00-10:35', "Бурение скважин", "Глебова Л.В.", "824а"],
                [2, '10:50-12:25', "Иностранный язык", "-", "-"],
                [3, '12:40-14:15', "Техника и технология добычи нефти и газа", "Коршунов А.Ю.", "805"],
                [4, '15:00-16:35', "Физика нефтяного пласта", "Михайлов Н.Н.", "801"],
                [5, '16:45 - 18:20', "Комп.обр.дан.нефтегаз.геол", "Аплеталин А.В.", "816"]
            ],
            "Вторник": [
                ['-', '-', "-", "-", "-"]
            ],
            "Среда": [
                [1, '9:00-10:35', "Промысловая геофизика", "Никитин А.А.", "301"],
                [2, '10:50-12:25', "Экономика", "Кононова Н.П.", "611"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", 'Межфакультетские курсы', "-", "-"],
                [5, "16:45-18:20", 'Межфакультетские курсы', "-", "-"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "Техника и технология добычи нефти и газа", "Коршунов А.Ю.", "832"],
                [2, '10:50-12:25', "Разработка нефтяных и газонефтяны месторождений", "Казаков А.А.", "805"],
                [3, '12:40 - 14:15', "Разработка нефтяных и газонефтяны месторождений", "Казаков А.А.", "805"],
                [4, '15:00-16:35', 'Промысловая геофизика', 'Никитин А.А.', "301"],
                [5, '16:45 - 18:20', 'Промысловая геофизика', 'Никитин А.А.', "301"]
            ],
            "Пятница": [
                [1, '9:00—10:35', "Экономика", "Шимук О.В.", "831"],
                [2, '10:50-12:25', "Разработка нефтяных и газонефтяны месторождений", "Казаков А.А.", "805"],
                [3, '12:40-14:15', 'Компьютер.обр.дан.нетегаз.геол', 'Аплеталин А.В.', '308'],
                [4, '12:40-14:15', 'Теоретические основы и методы поисков и разведки нефтяных и газовых месторождений', 'Шпуров И.В.', '610'],
                [5, '12:40-14:15', 'Теоретические основы и методы поисков и разведки нефтяных и газовых месторождений', 'Шпуров И.В.', '610']
            ]
        }
    },
    "4 курс": {

        False: {

            "Понедельник": [
                [1, '9:00-10:35', "Основы трехмерного фильтрационного моделирования месторождений нефти и за ", "Пуртова И.П.", "362"],
                [2, '10:50-12:25', "Основы трехмерного фильтрационного моделирования месторождений нефти и за ", "Пуртова И.П.", "362"],
                [3, '12:40-14:15', "Нефтегазоносные бассейны СНГ", "Фролов С.В.", "830"],
                [4, '15:00-16:35', "Геология России", "Никишин А.М.", "611"]
            ],
            "Вторник": [
                [1, '9:00-10:35', "Методы контроля и регулирования разработки месторождений нефти и газа ", "Коршунов А.Ю.", "801"],
                [2, '10:50-12:25', "Геология и геохимия горючих ископаемых", "Большакова М.А.", "824а"],
                [3, '12:40-14:15', "Геология России", "Хлебникова О.А.", "824а"],
                [4, '15:00-16:35', "Нефтегазоносные бассейны СНГ", "Фролов С.В.", "830"]
            ],
            "Среда": [
                [1, '9:00-10:35', "10:00-12:25 Геолого-геофизические основы нефтегазовой геомеханики ", "Попов С.Н.", "831"],
                [2, '10:50-12:25', "-", "-", "-"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", 'Разработка месторождений нетрадиционного углеводородного сырья', "Шандрыгин А.Н./Шпуров И.В.", "832"],
            ],
            "Четверг": [
                ["-", "-", "-", '-', '-']
            ],
            "Пятница": [
                [1, '9:00—10:35', "Иностранный язык ", "-", "-"],
                [2, '10:50-12:25', "Геоинформационные системы в геологии", "Симонов Д.А.", "816"],
                [3, '12:40-14:15', 'Геология России', 'Никишин А.М.', '415'],
                [4, '12:40-14:15', 'Методы интенсификации добычи нефти и газа', 'Рамазанов Р.Г.', '825']
            ]
        },

        True: {
            "Понедельник": [
                [1, '9:00-10:35', "Основы трехмерного фильтрационного моделирования месторождений нефти и за ", "Пуртова И.П.", "362"],
                [2, '10:50-12:25', "Основы трехмерного фильтрационного моделирования месторождений нефти и за ", "Пуртова И.П.", "362"],
                [3, '12:40-14:15', "Нефтегазоносные бассейны СНГ", "Фролов С.В.", "830"],
                [4, '15:00-16:35', "Геология России", "Никишин А.М.", "611"]
            ],
            "Вторник": [
                [1, '9:00-10:35', "Методы контроля и регулирования разработки месторождений нефти и газа ", "Коршунов А.Ю.", "801"],
                [2, '10:50-12:25', "Геология и геохимия горючих ископаемых", "Большакова М.А.", "824а"],
                [3, '12:40-14:15', "Геология России", "Хлебникова О.А.", "824а"],
                [4, '15:00-16:35', "Нефтегазоносные бассейны СНГ", "Фролов С.В.", "830"]
            ],
            "Среда": [
                [1, '9:00-10:35', "10:00-12:25 Геолого-геофизические основы нефтегазовой геомеханики ", "Попов С.Н.", "831"],
                [2, '10:50-12:25', "-", "-", "-"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", 'Разработка месторождений нетрадиционного углеводородного сырья', "Шандрыгин А.Н./Шпуров И.В.", "832"],
            ],
            "Четверг": [
                ["-", "-", "-", '-', '-']
            ],
            "Пятница": [
                [1, '9:00—10:35', "Иностранный язык ", "-", "-"],
                [2, '10:50-12:25', "Геоинформационные системы в геологии", "Симонов Д.А.", "816"],
                [3, '12:40-14:15', 'Геология России', 'Никишин А.М.', '415'],
                [4, '12:40-14:15', 'Методы интенсификации добычи нефти и газа', 'Рамазанов Р.Г.', '825'],
                [5, '16:45 - 18:20', 'Методы интенсификации добычи нефти и газа', 'Рамазанов Р.Г.', '825']
            ]
        }
    },
    "5 курс": {

        False: {

            "Понедельник": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "-", "-", "-"],
                [3, '12:40-14:15', "Трехмерное фильтрационное моделирование месторождений нефти и газа", "Пуртову И.П.", "Каф."],
                [4, '15:00-16:35', "Трехмерное фильтрационное моделирование месторождений нефти и газа", "Пуртову И.П.", "Каф."],
                [5, '16:45-18:20', "Факультатив. Фациальный анализ и палеогеография", "Барабошкин Е.Ю., Фокин П.А.", "-"],
            ],
            "Вторник": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "10:50 - 13:20 Иностранный язык", "-", "-"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, '15:00-16:35', "-", "-", "-"],
                [5, '16:45 - 18:20', "Факультатив. Учение о фациях и палеогеография ", "Чуркина В.В.", "804"]
            ],
            "Среда": [
                ["-", "-", "-", '-', '-']
            ],
            "Четверг": [
                [1, '9:00-10:35', "Специальные вопросы теории фильтрации", "Моторова К.А.", "362"],
                [2, '10:50-12:25', "Специальные вопросы теории фильтрации", "Моторова К.А.", "362"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", 'Промысловый геофизический контроль за разработкой месторождений нефти и газа', "Шагалов Ю.В.", "824а"],
                [5, "16:45-18:20", 'Промысловый геофизический контроль за разработкой месторождений нефти и газа', "Шагалов Ю.В.", "824а"]
            
            ],
            "Пятница": [
                [1, '9:00—10:35', "Особенности разработки морских нефтяных и газовых месторождений", "Ершов С.Е.", "611"],
                [2, '10:50-12:25', "Особенности разработки морских нефтяных и газовых месторождений", "Ершов С.Е.", "611"],
                [3, '12:40-14:15', '-', '-', '-'],
                [4, '12:40-14:15', '1/2 гр Геологические модели в нефтегазовой геологии ', 'Реймерс А.Н.', '362'],
                [5, '16:45 - 18:20', '1/2 гр Геологические модели в нефтегазовой геологии ', 'Реймерс А.Н.', '362'],
                [6, '18:30 - 20:05', 'Методы полевой геофизики при разведке и разработке месторождений нефти и газа', 'Шаманский С.В.', '804']
            ]
        },

        True: {
            "Понедельник": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "-", "-", "-"],
                [3, '12:40-14:15', "Трехмерное фильтрационное моделирование месторождений нефти и газа", "Пуртову И.П.", "Каф."],
                [4, '15:00-16:35', "Трехмерное фильтрационное моделирование месторождений нефти и газа", "Пуртову И.П.", "Каф."],
                [5, '16:45-18:20', "Факультатив. Фациальный анализ и палеогеография", "Барабошкин Е.Ю., Фокин П.А.", "-"],
            ],
            "Вторник": [
                [1, '9:00-10:35', "-", "-", "-"],
                [2, '10:50-12:25', "10:50 - 13:20 Иностранный язык", "-", "-"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, '15:00-16:35', "-", "-", "-"],
                [5, '16:45 - 18:20', "Факультатив. Учение о фациях и палеогеография ", "Чуркина В.В.", "804"]
            ],
            "Среда": [
                ["-", "-", "-", '-', '-']
            ],
            "Четверг": [
                [1, '9:00-10:35', "Специальные вопросы теории фильтрации", "Моторова К.А.", "362"],
                [2, '10:50-12:25', "Специальные вопросы теории фильтрации", "Моторова К.А.", "362"],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", 'Промысловый геофизический контроль за разработкой месторождений нефти и газа', "Шагалов Ю.В.", "824а"],
                [5, "16:45-18:20", 'Промысловый геофизический контроль за разработкой месторождений нефти и газа', "Шагалов Ю.В.", "824а"]
            
            ],
            "Пятница": [
                [1, '9:00—10:35', "Особенности разработки морских нефтяных и газовых месторождений", "Ершов С.Е.", "611"],
                [2, '10:50-12:25', "Особенности разработки морских нефтяных и газовых месторождений", "Ершов С.Е.", "611"],
                [3, '12:40-14:15', '-', '-', '-'],
                [4, '12:40-14:15', '1/2 гр Геологические модели в нефтегазовой геологии ', 'Реймерс А.Н.', '362'],
                [5, '16:45 - 18:20', '1/2 гр Геологические модели в нефтегазовой геологии ', 'Реймерс А.Н.', '362'],
                [6, '18:30 - 20:05', 'Методы полевой геофизики при разведке и разработке месторождений нефти и газа', 'Шаманский С.В.', '804']
            ]
        }
    },
    "6 курс": {

        False: {

            "Понедельник": [
                [1, '9:00-10:35', '-', '-', '-'],
                [2, '10:50-12:25', '-', '-', '-'],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, '15:00-16:35', '-', '-', '-'],
                [5, '16:45-18:20', "Проектирование разработки мест. нефти и газа", "Шпуров И.В.", "612"],
                [6, '18:30-20:05', "Проектирование разработки мест. нефти и газа", "Шпуров И.В.", "612"]
            ],
            "Вторник": [
                [1, '9:00-10:35', 'Иностранный язык', '-', '-'],
                [2, '10:50-12:25', '-', '-', '-'],
                [3, '12:40-14:15', "Цифровые технологии в геологии ", "Шпурова И.В.", "824а"],
                [4, '15:00-16:35', "Правовые основы недропользования", "Богуславский М.А.", "611"],
                [5, '16:45-18:20', 'Дисциплины по выбору на иностранном языке', '-', '-']
            ],
            "Среда": [
                [1, '9:00-10:35', '-', '-', '-'],
                [2, '10:50-12:25', '-', '-', '-'],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", '15:00 - 17:25 Текущий и капитальный ремонты нефтяных и газовых скважин', "Рамазанов Р.Г.", "805"],
                [5, '16:45-18:20', "17:40 Разработка, эксплуатация и хранение промышленного и углекислого газа в подземных хранилищах", "Шпуров И.В., Ситдликова Г.", "805"],
                [6, '18:30-20:05', "17:40 Разработка, эксплуатация и хранение промышленного и углекислого газа в подземных хранилищах", "Шпуров И.В., Ситдликова Г.", "805"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "Философия естествознания", "Жульева Н.В.", "611"],
                [2, '10:50-12:25', '-', '-', '-'],
                [3, '12:40 - 14:15', "Философия естествознания", "Жульева Н.В.", "611"]
            ],
            "Пятница": [
                ['-', '-', "-", "-", "-"],
            ],
            "Суббота": [
                [1, '9:00-10:35', "Экономическая оценка запасов нефти и газа", "Воронин Г.Ф.", "831"],
                [2, '10:50-12:25', "Экономическая оценка запасов нефти и газа", "Воронин Г.Ф.", "831"],
            ]
        },

        True: {
            "Понедельник": [
                [1, '9:00-10:35', '-', '-', '-'],
                [2, '10:50-12:25', '-', '-', '-'],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, '15:00-16:35', '-', '-', '-'],
                [5, '16:45-18:20', "Проектирование разработки мест. нефти и газа", "Шпуров И.В.", "612"],
                [6, '18:30-20:05', "Проектирование разработки мест. нефти и газа", "Шпуров И.В.", "612"]
            ],
            "Вторник": [
                [1, '9:00-10:35', 'Иностранный язык', '-', '-'],
                [2, '10:50-12:25', '-', '-', '-'],
                [3, '12:40-14:15', "Цифровые технологии в геологии ", "Шпурова И.В.", "824а"],
                [4, '15:00-16:35', "Правовые основы недропользования", "Богуславский М.А.", "611"],
                [5, '16:45-18:20', 'Дисциплины по выбору на иностранном языке', '-', '-']
            ],
            "Среда": [
                [1, '9:00-10:35', '-', '-', '-'],
                [2, '10:50-12:25', '-', '-', '-'],
                [3, '12:40-14:15', "-", "-", "-"],
                [4, "15:00-16:35", '15:00 - 17:25 Текущий и капитальный ремонты нефтяных и газовых скважин', "Рамазанов Р.Г.", "805"],
                [5, '16:45-18:20', "17:40 Разработка, эксплуатация и хранение промышленного и углекислого газа в подземных хранилищах", "Шпуров И.В., Ситдликова Г.", "805"],
                [6, '18:30-20:05', "17:40 Разработка, эксплуатация и хранение промышленного и углекислого газа в подземных хранилищах", "Шпуров И.В., Ситдликова Г.", "805"]
            ],
            "Четверг": [
                [1, '9:00-10:35', "Философия естествознания", "Жульева Н.В.", "611"]
            ],
            "Пятница": [
                ['-', '-', "-", "-", "-"],
            ],
            "Суббота": [
                [1, '9:00-10:35', "Экономическая оценка запасов нефти и газа", "Воронин Г.Ф.", "831"],
                [2, '10:50-12:25', "Экономическая оценка запасов нефти и газа", "Воронин Г.Ф.", "831"],
            ]
        }
    },
}
